<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Screens 4 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.cfranson.munki.Screens4</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Screens</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Access your computer remotely.</string>
			<key>developer</key>
			<string>Edovia Inc.</string>
			<key>display_name</key>
			<string>Screens 4</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.cfranson.download.Screens4</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            	</dict>
        	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		 <dict>
            		<key>Arguments</key>
            		<dict>
                		<key>input_plist_path</key>
                		<string>%pathname%/Screens 4.app/Contents/Info.plist</string>
                		<key>plist_version_key</key>
                		<string>CFBundleVersion</string>
            		</dict>
            		<key>Processor</key>
            		<string>Versioner</string>
        </dict>
	</array>
</dict>
</plist>
